<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Colossus</title>
</head>

<!-- $Id: colossusdoc.html,v 1.2 2004-09-11 15:47:08 Trocotronic Exp $ -->

<body>

<div align="center"><b><font size="+7">Colossus</font></b><br>
  <a href="http://www.rallados.net" target="_blank"><font size="3">http://www.rallados.net</font></a><font size="3"><br>
    <b>Versi&oacute;n actual:</b> 1.0a <br>
  <b>&Uacute;ltima modificaci&oacute;n:</b> 09/09/2004</font><br>
</div>
  <p><b><font size="3">Desarrollador:</font></b><font size="3"> Trocotronic<br>
    <b>Tester:</b> MaD</font><br>
  &nbsp;<br>
  <b><font size="6">&Iacute;NDICE</font></b><br>
  <font size="+1">1.- <a href="#intro">Introducción</a></font><br>
  <font size="+1">2.- <a href="#instalacion">Instalación</a></font><br>
  <font size="+1">3.- <a href="#caracteristicas">Características</a></font><br>
  <font size="+1">4.- <a href="#udb">UDB</a></font><br>
  <font size="+1">5.- <a href="#mysql">MySQL</a></font><br>
  <font size="+1">6.- <a href="#remoto">Conexi&oacute;n remota</a> </font><br>
    <font size="+1">7.- <a href="#configuracion">Configuración</a></font><br>
<font size="+1"> &nbsp; 7.1 <a href="#principal">Archivo principal</a></font><br>
<font size="+1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.1.1 <a href="#server">Bloque server { }</a></font><br>
  <font size="+1"> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.1.2 <a href="#smtp">Bloque smtp { }</a></font><br>
  <font size="+1"> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.1.3 <a href="#db">Bloque db { }</a></font><br>
  <font size="+1"> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.1.4 <a href="#set">Bloque set { }</a></font><br>
  <font size="+1"> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.1.5 <a href="#modulos">Directriz modulo</a></font><br>
    <font size="+1"> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.1.6 <a href="#log">Bloque log { }</a></font><br>
  <font size="+1">&nbsp;	7.2 <a href="#nickserv">NickServ</a></font><br>
    <font size="+1"> &nbsp; 7.3 <a href="#chanserv">ChanServ</a></font><br>
    <font size="+1"> &nbsp; 7.4 <a href="#operserv">OperServ</a></font><br>
    <font size="+1"> &nbsp; 7.5 <a href="#memoserv">MemoServ</a></font><br>
    <font size="+1"> &nbsp; 7.6 <a href="#ipserv">IpServ</a></font><br>
     
    <font size="+1">8.- <a href="#funciones">Comandos disponibles</a></font><br>
    <font size="+1">&nbsp; 8.1 <a href="#fnick">NickServ</a></font><br>
    <font size="+1"> &nbsp; 8.2 <a href="#fchan">ChanServ</a></font><br>
    <font size="+1"> &nbsp; 8.3 <a href="#foper">OperServ</a></font><br>
    <font size="+1"> &nbsp; 8.4 <a href="#fmemo">MemoServ</a></font><br>
    <font size="+1"> &nbsp; 8.5 <a href="#fip">IpServ</a></font><br>
     
    <font size="+1">9.- <a href="#patrones">Parámetros de patrón</a></font></p>
  <p><br>
    <b><font size="6"><a name="intro"></a>1.0 Introducci&oacute;n </font></b><br>
    Colossus es una aplicaci&oacute;n que permite gestionar y controlar infrastructuras de comunidades IRC.<br>
    Este documento puede imprimirse tantas veces como se desee pero su distribuci&oacute;n est&aacute; vinculada &uacute;nica y exclusivamente a Colossus, debiendo adjuntar el programa con el mismo.</p>
<p>    <b>Lea detenidamente</b> este archivo para configurar y comprender el uso de este programa. Est&aacute; unido a muchas caracter&iacute;sticas que requieren una especial atenci&oacute;n. </p>
<p>&nbsp;</p>
  <p><b><font size="6"><a name="instalacion"></a>2.0 Instalaci&oacute;n</font></b></p>
<p>Sistemas operativos soportados:</p>
  <ul><li>Windows XP Home  
  <li>Windows XP Professional  
  <li>Windows 2000  
  <li>Windows 2003  
  <li>Windows Me  
  <li>Windows 98</ul><br>
    Para	instalar	el	programa s&oacute;lo tiene que descomprimir el archivo .zip a una carpeta, preferiblemente C:\Colossus.

    <p>Una vez descomprimido, crea el archivo colossus.conf y config&uacute;relo a sus necesidades.</p>
    <p>&nbsp;</p>
  <p><b><font size="6"><a name="caracteristicas"></a>3.0 Caracter&iacute;sticas</font></b></p>
  <p>Estos servicios para IRC est&aacute;n programados en C. </p>
  <p>Se compone de un n&uacute;cleo o kernel que lo integran la gesti&oacute;n de conexiones o sockets, la de procesos o se&ntilde;ales, la de eventos o signals, la de retardos o timers, la de paginaci&oacute;n o cache y la de gesti&oacute;n de m&oacute;dulos o DLL's. Junto al n&uacute;cleo se une la base para la gesti&oacute;n de IRC que contiene varias macros que permiten modularizar los comandos y los robots de gesti&oacute;n de funciones. A su vez, estos robots poseen varias herramientas que optimizan su uso para que sean independientes entre s&iacute; y que puedan comunicarse mediante eventos. La administraci&oacute;n de la base de datos global funciona bajo MySQL y permite la memoria de registros de forma permanente. </p>
  <p>Tiene un simulador de servidor SMTP que permite enviar emails sin la necesidad de un servidor intermediario que requiera configuraci&oacute;n o registro. Adem&aacute;s, si un email no llega a enviarse se pone en la cola para volverlo a intentar hasta un m&aacute;ximo de tres veces. </p>
  <p>Las caracter&iacute;sticas culminan con los robots que son los m&oacute;dulos visibles ante los usuarios que conforman la red. Los m&oacute;dulos son archivos .dll. Cada uno tiene una funci&oacute;n concreta y determinada dentro de la red y ofrece varios servicios que permiten agilizar, a&ntilde;adir o incluso potenciar comandos (del propio IRCd o inexistentes). Estos robots son:</p>
  <ul>
    <li><b>NickServ:</b> gestiona los nicks y todo lo referente a ellos.     
    <li><b>ChanServ:</b> administra los canales y todo lo que les englobe.  
  <li><b>OperServ:</b> exclusivo para operadores de red.
  <li><b>MemoServ:</b> servicio de mensajer&iacute;a entre usuarios.   
  <li><b>IpServ: </b>servicio de ips virtuales.  
</ul>
  <p>&nbsp;</p>
  <p><b><font size="6"><a name="udb"></a>4.0 UDB (Unreal Data Base)</font></b></p>
  <p>El sistema UDB es exclusivo de Rallados. Su uso principal es la de poder distribuir bases de datos por toda la red de forma s&iacute;ncrona. As&iacute; se consigue que todos los nodos tengan unos registros globales que no dependan del mismo. Con s&oacute;lo introducir un registro en un nodo, inmediatamente se propaga por toda la red de forma instant&aacute;nea y sincronizada. </p>
  <p>Para ello se usa el protocolo UDB propuesto &uacute;nicamente para este fin. Actualmente el protocolo en desarrollo es el UDB3, dejando el primero obsoleto e incompatible la primera y segunda versi&oacute;n. Esta nueva versi&oacute;n incorpora cuantiosos cambios que dan lugar a un nuevo sistema de bases de datos. Es un protocolo abierto y libre, con lo cual se consigue que puedan usarse distintos servicios que potencien las caracter&iacute;sticas de la red al un&iacute;sono. Es tarea del desarrollador aprovechar estas caracter&iacute;sticas.</p>
  <p>El sistema se compone de varios bloques (nicks, canales, ips y set) que contienen varias directrices que conforman el ircd. Es parecido a la configuraci&oacute;n de UnrealIRCd, puesto que usa el formato bloque::seccion::subseccion valor. La propagaci&oacute;n de la red se hace mediante el comando DB. En este, se proporciona la informaci&oacute;n necesaria para a&ntilde;adir el registro en el nodo local y propagarlo al siguiente. As&iacute;, en pocos segundos toda la red queda actualizada con la informaci&oacute;n. Tan s&oacute;lo es necesario introducirla por un servidor HUB. Generalmente, y por norma, se hace a trav&eacute;s del nodo de servicio.</p>
  <p>Colossus tiene integrado soporte UDB de forma opcional (definido a voluntad del compilador). Est&aacute;n elaborados para explotar al m&aacute;ximo todas las opciones que ofrece UDB. Todas las tablas est&aacute;n preparadas para ser usadas con Colossus. Soporta servidores UnrealIRCd+UDB y UnrealIRCd official, ambos 3.2 y superiores. </p>
  <p>&nbsp;</p>
  <p><b><font size="6"><a name="mysql"></a>5.0 MySQL</font></b></p>
  <p>Colossus utiliza el sistema de base de datos libre MySQL. Para ello es necesario tener instalado este servicio en alguna m&aacute;quina. Puede descargarlo de <a href="http://dev.mysql.com/downloads/" target="_blank">http://dev.mysql.com/downloads/</a>.</p>
  <p>Una vez instalado deber&aacute; a&ntilde;adir un superusuario con una contrase&ntilde;a para que tenga acceso a todos los permisos. Una vez hecho esto, tendr&aacute; que crear una base de datos, que m&aacute;s adelante especificar&aacute; en la configuraci&oacute;n. Esta base de datos es la que se usar&aacute; para los robots. Tiene m&aacute;s informaci&oacute;n sobre la creaci&oacute;n de usuarios en <a href="http://www.ignside.net/man/mysql/users.php" target="_blank">http://www.ignside.net/man/mysql/users.php</a>. Si no quiere complicarse la vida puede utilizar <a href="http://dev.mysql.com/downloads/administrator/index.html" target="_blank">http://dev.mysql.com/downloads/administrator/index.html</a> y entrar con los nombres por defecto login: root y sin ninguna contrase&ntilde;a.</p>
  <p>Es posible que no sepa a&ntilde;adir o quitar permisos y que a la hora de crear las tablas no se creen o lo hagan mal. Por esta raz&oacute;n se incluye el archivo mysql.tablas, en el que contiene todas las sintaxis para crear las tablas &quot;manualmente&quot; a trav&eacute;s de alg&uacute;n editor como phpMyAdmin. Tan s&oacute;lo tiene que abrir el archivo y cambiar el prefijo por el que use. Recuerde que este proceso debe hacerse con Colossus cerrado. </p>
  <p>&nbsp;</p>
  <p><b><font size="6"><a name="udb"></a>6.0 Conexi&oacute;n remota</font></b></p>
  <p>Desde la versi&oacute;n 1.0a, Colossus incorpora un sistema para conectarlos a la red de forma remota mediante el comando /connect. Cuando se arranca el programa se pone en escucha el puerto al que se conecta para recibir conexiones remotas. Una vez se ha realizado la conexi&oacute;n, se cierra el puerto para no recibir m&aacute;s conexiones. Si se cierra la conexi&oacute;n a la red, se vuelve a poner en escucha para recibir otra vez la conexi&oacute;n y as&iacute; sucesivamente.<br>
    Su sintaxis es sencilla: /connect servidor.colossus.
Para poder utilizar este comando, debes especificar la ip en el bloque link { } de UnrealIRCd (no sirve '*'). </p>
  <p><b>Nota</b>: cabe poner una especial atenci&oacute;n en m&aacute;quinas donde se est&eacute; ejecutando el ircd y los servicios a la misma vez. En estas situaciones s&oacute;lo puede haber un mismo puerto en escucha. As&iacute;, el ircd y los servicios no pueden utilizar el mismo puerto de escucha. Por esta raz&oacute;n, existe la directriz opcional en el bloque server, puerto_escucha, para especificar otro puerto de escucha que no est&eacute; utilizando el ircd. Esta directriz es &uacute;til cuando los dos programas est&aacute;n bajo la misma m&aacute;quina y conectan entre s&iacute;. </p>
  <p>&nbsp;</p>
  <p><b><font size="6"><a name="configuracion"></a>7.0 Configuraci&oacute;n</font></b></p>
  <p>El archivo de configuraci&oacute;n tiene gran similitud con el archivo de configuraci&oacute;n del UnrealIRCd. La estructura es la siguiente:</p>
  <pre>bloque valor {
	directriz valor;
};</pre>
  <p>Ambos valores son opcionales, seg&uacute;n lo requiera el bloque o la directriz. Si el valor contiene varias palabras, deber&aacute; entrecomillarse todo el valor. Si s&oacute;lo tiene una palabra, el entrecomillado es opcional. Por ejemplo:</p>
  <p>servidor &quot;Colossus&quot;; // es correcto<br>
  servidor Colossus; // es correcto<br>
    servidor &quot;Mi servidor&quot;; // es correcto<br>
    servidor Mi servidor; // es incorrecto </p>
  <p>Cabe mencionar que si el valor contiene alg&uacute;n s&iacute;mbolo de comentario (#, // o /* */) el uso del entrecomillado es <b>obligatorio</b>, puesto que, de no hacerse as&iacute;, se tomar&iacute;a como un comentario y dar&iacute;a error.<br>
  As&iacute; pues, por ejemplo canal &quot;#canal&quot;; ser&iacute;a correcto; pero canal #canal; ser&iacute;a incorrecto. </p>
  <p>Adem&aacute;s, los comentarios pueden hacerse anteponiendo // para comentar toda esta l&iacute;nea o con /* */ para comentar varias l&iacute;neas.</p>
  <p>El archivo puede contener cada l&iacute;nea una directriz, o simplemente meter toda la configuraci&oacute;n en una s&oacute;la l&iacute;nea. Aunque por motivos de simplicidad y facilidad de manejo y configuraci&oacute;n, recomiendo usar l&iacute;nea por l&iacute;nea, distinguiendo claramente los bloques y directrices. </p>
  <p><b><font size="5"><a name="principal"></a>7.1 Archivo principal </font></b></p>
  <p>El archivo principal deber&aacute; llamarse <b>colossus.conf</b> y deber&aacute; localizarse en la misma carpeta donde se sit&uacute;e el ejecutable del programa, generalmente en C:\Colossus.</p>
  <p>El archivo se compone de varios bloques:</p>
  <p><b><font size="4"><a name="server"></a>7.1.1 Bloque server { } <font color="#FF0000">(obligatorio)</font></font></b></p>
  <pre>server {
	addr ip.a.conectar;
	puerto puerto;
	password {
		local &quot;pass local&quot;;
		remoto &quot;pass remoto&quot;;
	};
	host nombre.del.servidor;
	info &quot;informaci&oacute;n adicional&quot;;
	numeric numerico del servidor;<br>	puerto_escucha puerto;
};</pre>
  <p>Los valores se deducen f&aacute;cilmente. La directriz <b>addr</b> indica a qu&eacute; ip debe conectar, siendo<b> puerto</b> a qu&eacute; puerto debe hacerlo. El bloque <b>password { }</b> indica cu&aacute;les son las contrase&ntilde;as de conexi&oacute;n remota y local, especificadas en el bloque <b>link { }</b> de la m&aacute;quina a la que se va a conectar. El <b>host</b> es el servidor visible, el que ver&aacute;n los usuarios y en el que estar&aacute;n albergados los robots de servicio. El <b>numeric</b> indica la identificaci&oacute;n del servidor. Debe ser un n&uacute;mero entre 0 y 255 (ambos inclu&iacute;dos) y <b>NO</b> debe estar repetido en la red. Es decir, ning&uacute;n otro servidor de la red deber&aacute; tener el mismo numeric. El <b>puerto_escucha</b> es opcional y define un puerto para escuchar y recibir conexiones remotas. Debe usarse en caso de que no se pueda poner en escucha el <b>puerto</b>.</p>
  <p>Ejemplo:</p>
  <pre>server {<br>	addr 127.0.0.1;<br>	puerto 6667;<br>	password {<br>		local openaccess;<br>		remoto openaccess;<br>	};<br>	host Servicios.Colossus;<br>	info &quot;Servidor en C&quot;;<br>	numeric 1;<br>	puerto_escucha 6666;<br>};</pre>
<p>&nbsp;</p>
  <p><b><font size="4"><a name="smtp"></a>7.1.2 Bloque smtp { } <font color="#0000FF">(opcional)</font></font></b></p>
  <pre>smtp {<br>	host host.del.servidor.smtp;<br>	login &quot;milogin&quot;;<br>	pass &quot;mipass&quot;;<br>};</pre>
  <p><br>
  Este bloque configura los par&aacute;metros para enviar emails desde el programa. La directriz <b>host</b> indica la direcci&oacute;n de la m&aacute;quina smtp. Puede ser ip o host. El <b>login</b> es <i>opcional</i>. Si se especifica, indica que el servidor SMTP no es libre y requiere autentificaci&oacute;n. Si no se especifica, esta directriz, se asume que no es necesaria ninguna identificaci&oacute;n y procede al env&iacute;o an&oacute;nimo. El <b>pass</b> es necesario en caso de haber especificado un <b>login</b>. Si no, puede omitirse.</p>
<p>Si este bloque no se especifica, el programa usar&aacute; su propio servidor smtp. As&iacute;, cuando sea necesario enviar un email lo enviar&aacute; directamente al servidor POP del usuario, sin la necesidad de pasar por un SMTP. Esto ofrece una ventaja, ya que no es necesario el registro en ning&uacute;n servidor SMTP. Pero por contra es m&aacute;s inestable que el pasar por un SMTP, ya que de esta forma conecta a distintos sitios; mientras que usando un SMTP, s&oacute;lo conecta a uno.<br>
  <b>Nota</b>: bajo sistemas Windows 9x/ME este bloque es <b>obligatorio</b>.</p>
  <p>Ejemplo:</p>
  <pre>smtp {<br>	host smtp.telefonica.net;<br>	login milogin$telefonica.net;<br>	pass mipass;<br>};
</pre>
  <p>&nbsp;</p>
  <p><b><font size="4"><a name="db"></a>7.1.3 Bloque db { } <font color="#FF0000">(obligatorio)</font></font></b></p>
  <pre>db {<br>	host host;<br>	login login;<br>	pass pass;<br>	nombre db;<br>	prefijo prefijo_;
	puerto puerto;<br>};</pre>
  <p>Establece la configuraci&oacute;n para utilizar MySQL. El <b>host</b> indica d&oacute;nde se ubica el servidor. Generalmente es <i>localhost</i> o <i>127.0.0.1</i>. El <b>login</b> es el que se utiliza para conectar como usuario. Se recomienda encarecidamente usar un login de superusuario para utilizar todos los privilegios. Si el <b>login</b> requiere una contrase&ntilde;a, puedes especificarla en <b>pass</b> (<i>opcional</i>). El <b>nombre</b> es el nombre de la base de datos. Al arrancar los robots, si esta base de datos no se encuentra, se pregunta al usuario si quiere crearla. Y en caso de tener privilegios, Colossus se encarga de crearla. El <b>prefijo</b> se utiliza para que las tablas que utiliza Colossus est&eacute;n precedidas por un prefijo con el fin de distinguirlas de las dem&aacute;s que pueda tener el usuario.</p>
  <p>Ejemplo:</p>
  <pre>db {<br>	host localhost;<br>	login milogin;<br>	pass mipass;<br>	nombre rallados;<br>	prefijo colossus_;<br>};</pre>
  <p>&nbsp;</p>
  <p><b><font size="4"><a name="set"></a>7.1.4 Bloque set { } <font color="#FF0000">(obligatorio)</font></font></b></p>
<pre>set {<br>	autobop;  //opcional<br>	respuesta PRIVMSG;<br>	rekill;  //opcional
	rejoin;  //opcional<br>	no_server_deop;  //opcional<br>	admin mail@admin.com;<br>	autojoin {<br>		usuarios &quot;#canal1,#canal2...&quot;;<br>		opers &quot;#canal1,#canal2...&quot;;<br>	};  //opcional<br>	modos {<br>		usuarios +modos-modos;<br>		canales +modos-modos;<br>	};  //opcional<br>	root nickdelroot;<br>	cloak {<br>		llave1;<br>		llave2;<br>		llave3;<br>	};<br>	reconectar {<br>		intentos &quot;n&ordm; intentos&quot;;<br>		intervalo &quot;n&ordm; intervalo&quot;;<br>	};
	debug &quot;#canal&quot;; //opcional
};</pre>
<p>Este bloque configura los par&aacute;metros del programa. El <b>autobop</b> indica que los robots obtienen el estado de @ al entrar en un canal. La <b>respuesta</b> indica c&oacute;mo debe procederse: por <b>PRIVMSG</b> o por <b>NOTICE</b>. S&oacute;lo acepta estas dos opciones. El par&aacute;metro <b>rekill</b> hace que el robot sea reconectado en caso de haber sido killeado. El <b>rejoin</b> hace que el robot sea introducido en el canal donde haya sido expulsado. El <b>no_server_deop</b> se utiliza para evitar que al linkar dos nodos, uno quite todos los modos de .&amp;@%+ que pueda haber en un canal. El <b>admin</b> se utiliza para indicar cu&aacute;l es el email del administrador o el de la red. Se utiliza como remitente en el env&iacute;o de emails. El bloque <b>autojoin { } </b> fija los canales en los que entrar&aacute;n autom&aacute;ticamente los usuarios y/o los operadores de red. Para especificar varios canales, sep&aacute;relos con comas. Los <b>modos { } </b> indican qu&eacute; modos deben ser permanentes (si es +) o qu&eacute; modos no pueden utilizarse en la red (si es -), ya sea en canales como en usuarios. El <b>root</b> indica qu&eacute; nick es el superusuario de los robots. Cuando se identifique como administrador de red (+N), tenga el nick registrado e identificado (+r) y figure como root en esta configuraci&oacute;n, adquirir&aacute; autom&aacute;ticamente el estado de superusuario o root. El bloque <b>cloak { } </b>debe ser id&eacute;ntico al de la configuraci&oacute;n de las 'cloak keys' de la red para un correcto cifrado. El bloque <b>reconectar { }</b> indica si debe procederse a reconectar los servicios en caso de una desconexi&oacute;n involuntaria, indicando el n&uacute;mero de <b>intentos</b> y la frecuencia o el <b>intervalo</b> con que debe hacerlo. Ambos valores deben ser n&uacute;meros positivos. El <b>debug</b> indica el canal en el que se hace debug de toda la red si est&aacute; presente.</p>
<p>Ejemplo:</p>
<pre>set {<br>	autobop;<br>	respuesta PRIVMSG;<br>	rekill;
	rejoin;<br>	no_server_deop;<br>	admin mi@email.com;<br>	autojoin {<br>		usuarios &quot;#colossus&quot;;<br>		opers &quot;#operadores&quot;;<br>	};<br>	modos {<br>		usuarios +i-d;<br>		canales +S-i;<br>	};<br>	root Colossus;<br>	cloak {<br>		abcdefg;<br>		hijklmn;<br>		opqrstu;<br>	};<br>	reconectar {<br>		intentos 3;<br>		intervalo 5;<br>	};
	debug &quot;#debug&quot;;
};</pre>
  <p>&nbsp;</p>
  <p><b><font size="4"><a name="modulos"></a>7.1.5 Directriz modulo <font color="#0000FF">(opcional)</font></font></b></p>
  <pre>modulo &quot;ruta/archivo.dll&quot;;</pre>
  <p>Indica qu&eacute; m&oacute;dulo debe cargarse. Cada m&oacute;dulo es una DLL. As&iacute;, puedes descargar m&oacute;dulos de terceras personas e integrarlos a Colossus sin ni siquiera reiniciar el programa. Para cargarlos basta con a&ntilde;adirlos al archivo de configuraci&oacute;n y usar /rehash servidor.de.colossus para que se refresquen. Es conveniente que todos los m&oacute;dulos est&eacute;n en C:\Colossus\modulos. </p>
  <p>&nbsp;</p>
  <p><a name="log"></a><font size="4"><b>7.1.6 Bloque log { } <font color="#0000FF">(opcional)</font></b></font></p>
  <pre>log archivo {
	tama&ntilde;o kbytes; // opcional
	opciones {
		servidores;
		conexiones;
		errores;
	};
};
</pre>
  <p>Este bloque se utiliza para loguear en <b>archivo</b> los eventos que sean de inter&eacute;s y a su elecci&oacute;n. Estos eventos se escogen mediante el bloque <b>opciones</b>. Estas <b>opciones</b> son:</p>
  <ul>
    <li><b>servidores</b>: cuando se conecta un servidor a la red.</li>
    <li><b>conexiones</b>: cuando se abre una conexi&oacute;n a una m&aacute;quina remota.</li>
    <li><b>errores</b>: cuando se causa una desconexi&oacute;n del servidor con mensaje de error.</li>
  </ul>
  <p>Adem&aacute;s, puede especificar de forma opcional el <b>tama&ntilde;o</b> m&aacute;ximo que quiere que ocupe el archivo. Su valor se especifica en KiloBytes. </p>
  <p>Ejemplo:</p>
  <pre>log colossus.log {
	tama&ntilde;o 4;
	opciones {
		conexiones;
		servidores;
	};
};</pre>
  <br>
  <p><br>
  Colossus incorpora varios m&oacute;dulos de serie. Los siguientes m&oacute;dulos de a continuaci&oacute;n requieren una configuraci&oacute;n aparte. Estas configuraci&oacute;nes deben localizarse en la carpeta modulos\ (o donde se ubique la .dll que lo carga) dentro de la carpeta principal, generalmente C:\Colossus\modulos.</p>
  <p>Algunos  requieren que est&eacute;n cargados otros m&oacute;dulos antes.</p>
  <p><b><font size="5"><a name="nickserv"></a>7.2 NickServ</font></b></p>
  <p>Nombre del archivo <b>NickServ.inc</b>.</p>
  <p>Requiere: <b>chanserv.dll</b>. </p>
  <pre>NickServ {<br>	nick nick;<br>	ident ident;<br>	host host;<br>	realname realname;<br>	modos modos;<br>	sid;  //opcional<br>	secure;  //opcional<br>	automigrar;  //opcional<br>	prot KILL|NICK;<br>	recovernick formato-%s;<br>	securepass formato;<br>	min_reg n&ordm;;<br>	autodrop n&ordm;;  //opcional<br>	nicks n&ordm;;  //opcional<br>	intentos n&ordm;;<br>	maxlist n&ordm;;<br>	forbmails {<br>		dominio1;
		dominio2;
		...<br>	};  //opcional<br>	residente &quot;#canal1,...,#canalN&quot;;  //opcional<br>	funciones {<br>		funci&oacute;n1;
		funci&oacute;n2;
		...
		funci&oacute;nN;<br>	};<br>};</pre>
<p>Los par&aacute;metros <b>nick, ident, host, realname </b>y<b> modos</b> son comunes a todos los m&oacute;dulos. Su uso no precisa de explicaci&oacute;n. El <b>sid</b> indica identificaci&oacute;n segura. El comando para identificarse deber&aacute; usarse con /msg nick@servidor, en vez del cl&aacute;sico /msg nick. El <b>secure</b> se utiliza para que los usuarios no falseen sus cuentas de correo. Al registrar un nick, si est&aacute; especificado <b>secure</b>, se le enviar&aacute; una contrase&ntilde;a temporal al mail especificado. El <b>automigrar</b>, si est&aacute; en soporte UDB, realiza la migraci&oacute;n autom&aacute;tica del registro del nick a las tablas de toda la red. El <b>prot</b> especifica qu&eacute; tipo de acci&oacute;n hay que tomar cuando se rebasa el tiempo de espera necesario para identificarse como due&ntilde;o de un nick. S&oacute;lo acepta dos opciones: <b>KILL </b>(el usuario es desconectado) o <b>NICK</b> (se le cambia el nick al usuario). El <b>recovernick</b> es el patr&oacute;n que se sigue al cambiar el nick a un usuario. El par&aacute;metro %s es sustitu&iacute;do por el nick anterior. Para m&aacute;s informaci&oacute;n lea la secci&oacute;n de <a href="#patrones">parámetros de patrón</a>. El <b>securepass</b> es el formato a seguir para la creaci&oacute;n de contrase&ntilde;as seguras. El <b>min_reg</b> es un n&uacute;mero que indica cu&aacute;ntas horas deben pasar antes de poder volver a registrar un nick. El <b>autodrop</b> es un n&uacute;mero que indica cu&aacute;ntos d&iacute;as deben de pasar sin usarse un nick para que sea dropado autom&aacute;ticamente. El par&aacute;metro <b>nicks</b> es un n&uacute;mero para indicar cu&aacute;ntos nicks se pueden registrar bajo una misma cuenta. El <b>intentos</b> es el n&uacute;mero de intentos que tiene un usuario para identificarse como propietario de su nick. Si sobrepasa este n&uacute;mero, se ejecuta la acci&oacute;n especificada en <b>prot</b>. El <b>maxlist</b> es un n&uacute;mero para evitar flood cuando un usuario solicite alguna lista, puesto que es el n&uacute;mero m&aacute;ximo de entradas que ser&aacute;n mostradas. El bloque <b>forbmails { }</b> se usa para no permitir el registro de nicks bajo cuentas email con los dominios especificados. La directriz <b>residente</b> se utiliza para especificar los canales en qu&eacute; el robot est&aacute; residente. &Uacute;sese una coma (',') para especificar varios canales. El bloque <b>funciones { }</b> tambi&eacute;n  es com&uacute;n a todos los m&oacute;dulos e indica qu&eacute; funciones soporta el robot. Es muy &uacute;til si quiere deshabilitarse un comando. Tiene las funciones de NickServ en su <a href="#fnick">sección</a>. </p>
<p>Ejemplo:</p>
<pre>NickServ {<br>	nick NickServ;<br>	ident colossus;<br>	host Servicios.Colossus;<br>	realname &quot;Servicio de gesti&oacute;n de nicks&quot;;<br>	modos owhraAOkNCqBvd;<br>	sid;<br>	secure;<br>	automigrar;<br>	prot kill;<br>	recovernick inv-%s-????;<br>	securepass *******;<br>	min_reg 24;<br>	autodrop 15;<br>	nicks 3;<br>	intentos 3;<br>	maxlist 30;<br>	forbmails {<br>		hotmail.com;<br>	};<br>	residente &quot;#rallados&quot;;<br>	funciones {<br>		...<br>	};<br>};</pre>
<p>&nbsp;</p>
<p><b><font size="5"><a name="chanserv"></a>7.3 ChanServ</font></b></p>
<p>Nombre del archivo <b>ChanServ.inc</b>.</p>
<pre>ChanServ {<br>	nick nick;<br>	ident ident;<br>	host host;<br>	realname realname;<br>	modos modos;<br>	sid;  //opcional<br>	autodrop n&ordm;;<br>	maxlist n&ordm;;<br>	bantype n&ordm;;
	automigrar;  //opcional<br>	tokens {<br>		formato format;<br>		vigencia n&ordm;;<br>		necesarios n&ordm;;<br>		antig n&ordm;;<br>	};<br>	residente &quot;#canal1,...,#canalN&quot;;  //opcional<br>	funciones {<br>		funci&oacute;n1;
		funci&oacute;n2;
		...
		funci&oacute;nN;<br>	};<br>};
</pre>
<p>Los par&aacute;metros <b>nick, ident, host, realname </b>y<b> modos</b> son comunes a todos los m&oacute;dulos. Su uso no precisa de explicaci&oacute;n. El <b>sid</b> indica identificaci&oacute;n segura. El comando para identificarse deber&aacute; usarse con /msg nick@servidor, en vez del cl&aacute;sico /msg nick. El <b>autodrop</b> es un n&uacute;mero que indica cu&aacute;ntos d&iacute;as deben de pasar sin usarse un canal para que sea dropado autom&aacute;ticamente.  El <b>maxlist</b> es un n&uacute;mero para evitar flood cuando un usuario solicite alguna lista, puesto que es el n&uacute;mero m&aacute;ximo de entradas que ser&aacute;n mostradas. El <b>bantype</b> es el tipo de ban que se usar&aacute; en las listas de auto-kick. El <b>automigrar</b>, si est&aacute; en soporte UDB, realiza la migraci&oacute;n autom&aacute;tica del registro del canal a las tablas de toda la red. El bloque <b>tokens { }</b> configura todo el sistema de tokens o 'firmas digitales'. El <b>formato</b> indica qu&eacute; forma deben tener los tokens. La <b>vigencia</b> indica cu&aacute;ntas horas tiene de vida el token solicitado. El <b>necesarios</b> es el n&uacute;mero que indica cu&aacute;ntos tokens son necesarios para presentar una petici&oacute;n de registro de un canal. El <b>antig</b> indica cu&aacute;ntos d&iacute;as tiene que tener registrado el nick como m&iacute;nimo para solicitar un token. La directriz <b>residente</b> se utiliza para especificar los canales en qu&eacute; el robot est&aacute; residente. &Uacute;sese una coma (',') para especificar varios canales.  El bloque <b>funciones { }</b> tambi&eacute;n es com&uacute;n a todos los m&oacute;dulos e indica qu&eacute; funciones soporta el robot. Es muy &uacute;til si quiere deshabilitarse un comando. Tiene las funciones de ChanServ en su <a href="#fchan">sección</a>.</p>
<p>Ejemplo:</p>
<pre>ChanServ {<br>	nick ChanServ;<br>	ident colossus;<br>	host Servicios.Colossus;<br>	realname &quot;Servicio de gesti&oacute;n de canales&quot;;<br>	modos owhraAOkNCqBvd;<br>	sid;<br>	autodrop 15;<br>	maxlist 30;<br>	bantype 9;<br>	tokens {<br>		formato &quot;############&quot;;<br>		vigencia 24; /* en horas */<br>		necesarios 1;<br>		antig 15; /* en d&iacute;as */<br>	};
	residente &quot;#rallados&quot;;<br>	funciones {<br>		...<br>	};<br>};</pre>
<p>&nbsp;</p>
<p><b><font size="5"><a name="operserv"></a>7.4 OperServ</font></b></p>
<p>Nombre del archivo <b>OperServ.inc</b>.</p>
<p>Requiere: <b>chanserv.dll</b>, <b>memoserv.dll</b>. </p>
<pre>OperServ {<br>	nick nick;<br>	ident ident;<br>	host host;<br>	realname realname;<br>	modos modos;<br>	bline &quot;mensaje: %s&quot;;<br>	autoop;
	clones n&ordm;; //si no tiene soporte UDB<br>	residente &quot;#canal1,...,#canalN&quot;;  //opcional<br>	funciones {<br>		...<br>	};<br>};<br>
</pre>
<p>Los par&aacute;metros <b>nick, ident, host, realname </b>y<b> modos</b> son comunes a todos los m&oacute;dulos. Su uso no precisa de explicaci&oacute;n. El mensaje <b>bline</b> se utiliza para poner un bloqueo desde los servicios de tipo Q. Use el par&aacute;metro %s para indicar el motivo (ser&aacute; substitu&iacute;do). El <b>autoop</b> se utiliza para que los operadores de red obtengan @ al entrar en un canal autom&aacute;ticamente no registrado (en un registrado deber&aacute; tener su correspondiente acceso). El par&aacute;metro <b>clones</b> s&oacute;lo debe especificarse si el programa no est&aacute; en soporte UDB e indica cu&aacute;l es el n&uacute;mero por defecto de conexiones simult&aacute;neas permitidas en la red o clones. La directriz <b>residente</b> se utiliza para especificar los canales en qu&eacute; el robot est&aacute; residente. &Uacute;sese una coma (',') para especificar varios canales.  El bloque <b>funciones { }</b> tambi&eacute;n es com&uacute;n a todos los m&oacute;dulos e indica qu&eacute; funciones soporta el robot. Es muy &uacute;til si quiere deshabilitarse un comando. Tiene las funciones de OperServ en su <a href="#foper">sección</a>.</p>
<p>Ejemplo:</p>
<pre>OperServ {<br>	nick OperServ;<br>	ident colossus;<br>	host Servicios.Colossus;<br>	realname &quot;Servicio de gesti&oacute;n para operadores&quot;;<br>	modos owhraAOkNCqBvd;<br>	residente &quot;#rallados&quot;;<br>	bline &quot;Bot-Lined: %s&quot;;<br>	autoop;<br>	funciones {<br>		funci&oacute;n1;
		funci&oacute;n2;
		...
		funci&oacute;nN;<br>	};<br>};<br>
</pre>
<p><b><font size="5"><a name="memoserv"></a>7.5 MemoServ</font></b></p>
<p>Nombre del archivo <b>MemoServ.inc</b>.</p>
<p>Requiere: <b>chanserv.dll</b>. </p>
<pre>MemoServ {<br>	nick nick;<br>	ident ident;<br>	host host;<br>	realname realname;<br>	modos modos;<br>	defecto n&ordm;;<br>	cada n&ordm;;<br>	residente &quot;#canal1,...,#canalN&quot;;  //opcional<br>	funciones {<br>		...<br>	};<br>};<br>
</pre>
<p>Los par&aacute;metros <b>nick, ident, host, realname </b>y<b> modos</b> son comunes a todos los m&oacute;dulos. Su uso no precisa de explicaci&oacute;n. El <b>defecto</b> es el n&uacute;mero del l&iacute;mite de mensajes por defecto que acepta un usuario. El <b>cada</b> indica cu&aacute;ntos segundos deben transcurrir antes de poder enviar otro mensaje. La directriz <b>residente</b> se utiliza para especificar los canales en qu&eacute; el robot est&aacute; residente. &Uacute;sese una coma (',') para especificar varios canales.  El bloque <b>funciones { }</b> tambi&eacute;n es com&uacute;n a todos los m&oacute;dulos e indica qu&eacute; funciones soporta el robot. Es muy &uacute;til si quiere deshabilitarse un comando. Tiene las funciones de MemoServ en su <a href="#fmemo">sección</a>.</p>
<p>Ejemplo:</p>
<pre>MemoServ {<br>	nick MemoServ;<br>	ident colossus;<br>	host Servicios.Colossus;<br>	realname &quot;Servicio de mensajer&iacute;a&quot;;<br>	modos owhraAOkNCqBvd;<br>	defecto 5;<br>	cada 60;<br>	residente &quot;#rallados&quot;;<br>	funciones {<br>		...<br>	};<br>};
</pre>
<p>&nbsp;</p>
<p><b><font size="5"><a name="ipserv"></a>7.6 IpServ</font></b></p>
<p>&nbsp;Nombre del archivo <b>IpServ.inc</b>.</p>
<pre>IpServ {<br>	nick nick;<br>	ident ident;<br>	host host;<br>	realname realname;<br>	modos modos;<br>	sufijo sufijo;<br>	cambio n&ordm;;<br>	residente &quot;#canal1,...,#canalN&quot;;  //opcional<br>	funciones {<br>		funci&oacute;n1;
		funci&oacute;n2;
		...
		funci&oacute;nN;<br>	};<br>};
</pre>
<p>Los par&aacute;metros <b>nick, ident, host, realname </b>y<b> modos</b> son comunes a todos los m&oacute;dulos. Su uso no precisa de explicaci&oacute;n. El <b>sufijo</b> es el sufijo que se a&ntilde;adir&aacute; a la ip virtual si se precisa. El <b>cambio</b> son las horas en que se cambia el cifrado de ip virtuales. La directriz <b>residente</b> se utiliza para especificar los canales en qu&eacute; el robot est&aacute; residente. &Uacute;sese una coma (',') para especificar varios canales.  El bloque <b>funciones { }</b> tambi&eacute;n es com&uacute;n a todos los m&oacute;dulos e indica qu&eacute; funciones soporta el robot. Es muy &uacute;til si quiere deshabilitarse un comando. Tiene las funciones de IpServ en su <a href="#fip">sección</a>.</p>
<p>Ejemplo:</p>
<pre>IpServ {<br>	nick IpServ;<br>	ident colossus;<br>	host Servicios.Colossus;<br>	realname &quot;Servicio de gesti&oacute;n de ips&quot;;<br>	modos owhraAOkNCqBvd;<br>	sufijo virtual;<br>	cambio 24; // en horas<br>	residente &quot;#rallados&quot;;<br>	funciones {<br>		...<br>	};<br>};
</pre>
<p>&nbsp;</p>

<p>&nbsp;</p>
<p><b><font size="6"><a name="funciones"></a>8.0 Comandos disponibles</font></b></p>
<p>Cada robot dispone de varios comandos que pueden cargarse o descargarse de la configuraci&oacute;n. Estos comandos son los que deben incluirse en el bloque <b>funciones { }</b> en la configuraci&oacute;n de cada robot.</p>
<p><b><font size="5"><a name="fnick"></a>8.1 Nickserv</font></b></p>
<pre>help
register
identify
set
drop
sendpass
info
list
ghost
suspender
liberar
addwhois
delwhois
rename
migrar  //s&oacute;lo en soporte UDB
demigrar  //s&oacute;lo en soporte UDB</pre>
<p>&nbsp;</p>
<p><b><font size="5"><a name="fchan"></a>8.2 Chanserv</font></b></p>
<pre>help
deauth
drop
identify
info
invite
op
deop
half
dehalf
voice
devoice
kick
ban
unban
clear
set
akick
access
list
join
sendpass
suspender
liberar
forbid
unforbid
block
register
token
migrar  //s&oacute;lo en soporte UDB
demigrar  //s&oacute;lo en soporte UDB
proteger  //s&oacute;lo en soporte UDB</pre>
<p>&nbsp;</p>
<p><b><font size="5"><a name="foper"></a>8.3 OperServ</font></b></p>
<pre>help
raw
restart
backup
rehash
restaura
blocks
opers
sajoin
sapart
rejoin
kill
global
noticias
clones
close
modos //s&oacute;lo en soporte UDB</pre>
<p>&nbsp;</p>
<p><b><font size="5"><a name="fmemo"></a>8.4 MemoServ</font></b></p>
<pre>help
send
read
del
list
set
info
cancelar
</pre>
<p>&nbsp;</p>
<p><b><font size="5"><a name="fip"></a>8.5 IpServ</font></b></p>
<pre>help
setipv
setipv2
temphost
</pre>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p><b><font size="6"><a name="patrones"></a>9.0 Par&aacute;metros de patr&oacute;n</font></b></p>
<p>Algunos campos requieren un patr&oacute;n a seguir que contenga comodines que sean intercambiados por valores aleatorios. Estos son:</p>
<ul>
  <li>? una cifra</li>
  <li>&ordm; una may&uacute;scula</li>
  <li>! una min&uacute;scula</li>
  <li># una may&uacute;scula o min&uacute;scula </li>
  <li>* una cifra, una may&uacute;scula o una min&uacute;scula</li>
</ul>
<p>As&iacute; pues, si alg&uacute;n campo que as&iacute; lo requiera pone &quot;*******&quot; cada comod&iacute;n ser&aacute; sustitu&iacute;do por un valor aleatorio. Si usa &quot;????&quot; devolver&iacute;a cuatro cifras. Ejemplos:</p>
<ul>
  <li>????? &gt; 89391</li>
  <li>##### &gt; aBEcP</li>
  <li>?&ordm;?!?# &gt; 2O4eL</li>
  <li>patata??? &gt; patata832</li>
  <li>to**mate &gt; to9Umate</li>
</ul>
<p>Adem&aacute;s, algunos campos pueden requerir un par&aacute;metro adicional, %s, para que sea rellenado por el propio programa con alguna cadena. Por ejemplo, en el cambio de nick, si en formato utilizas inv-%s-???, si el usuario se llama 'melon', se le cambiar&aacute; el nick por 'inv-melon-987'.</p>
</body>
</html>
